vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MKV10Z7_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd" schemaVersion="1.4">
  <name>MKV10Z7_DFP</name>
  <vendor>NXP</vendor>
  <description>Device Family Pack for MKV10Z7</description>
  <url>https://mcuxpresso.nxp.com/cmsis_pack/repo/</url>
  <license>Licenses.txt</license>
  <releases>
    <release version="16.0.0" date="2023-01-16">NXP CMSIS Packs based on MCUXpresso SDK 2.13.0</release>
    <release version="15.0.0" date="2022-07-13">NXP CMSIS Packs based on MCUXpresso SDK 2.12.0</release>
    <release version="14.0.0" date="2022-01-05">NXP CMSIS Packs based on MCUXpresso SDK 2.11.0</release>
    <release version="13.1.0" date="2021-07-13">NXP CMSIS Packs based on MCUXpresso SDK 2.10.0</release>
    <release version="13.0.0" date="2021-02-05">NXP CMSIS Packs based on MCUXpresso SDK 2.9.0 with restructured startup component files</release>
    <release version="12.0.0" date="2021-01-14">NXP CMSIS Packs based on MCUXpresso SDK 2.9.0</release>
  </releases>
  <keywords>
    <keyword>Device Family Pack</keyword>
  </keywords>
  <taxonomy>
    <description Cclass="Board Support" Cgroup="SDK Project Template">NXP MCUXpresso SDK Project Template</description>
    <description Cclass="Device" Cgroup="SDK Project Template">NXP MCUXpresso SDK RTE Device Project Template</description>
    <description Cclass="Device" Cgroup="SDK Drivers">NXP MCUXpresso SDK Peripheral Drivers</description>
    <description Cclass="Device" Cgroup="SDK Utilities">NXP MCUXpresso SDK Utilities</description>
    <description Cclass="Device" Cgroup="Startup">NXP MCUXpresso SDK Start up</description>
    <description Cclass="CMSIS Driver">NXP MCUXpresso SDK Peripheral CMSIS Drivers</description>
  </taxonomy>
  <requirements>
    <packages>
      <package name="CMSIS" vendor="ARM" version="5.8.0"/>
    </packages>
    <languages>
      <language name="C" version="99"/>
    </languages>
  </requirements>
  <devices>
    <family Dfamily="MKV10Z7" Dvendor="NXP:11">
      <description>KV1x: Kinetis KV1x-75 MHz,  Entry-level 3ph FOC / Sensorless Motor Control MCUs based on ARM® Cortex®-M0+</description>
      <device Dname="MKV10Z16xxx7">
        <processor Dcore="Cortex-M0+" Dfpu="NO_FPU" Dmpu="NO_MPU" Dendian="Little-endian" Dclock="75000000"/>
        <environment name="iar">
          <file category="linkerfile" name="iar/MKV10Z16xxx7_flash.icf"/>
        </environment>
        <memory name="PROGRAM_FLASH" start="0x00000000" size="0x4000" access="rx" default="1" startup="1"/>
        <memory name="SRAM" start="0x1ffff800" size="0x2000" access="rw" default="1"/>
        <algorithm name="arm/MKV_P16_1KB_SEC.FLM" start="0x00000000" size="0x00004000" RAMstart="0x20000000" RAMsize="0x00000800" default="1"/>
        <debug svd="MKV10Z7.xml"/>
        <variant Dvariant="MKV10Z16VFM7">
          <compile header="fsl_device_registers.h" define="CPU_MKV10Z16VFM7"/>
        </variant>
        <variant Dvariant="MKV10Z16VLC7">
          <compile header="fsl_device_registers.h" define="CPU_MKV10Z16VLC7"/>
        </variant>
        <variant Dvariant="MKV10Z16VLF7">
          <compile header="fsl_device_registers.h" define="CPU_MKV10Z16VLF7"/>
        </variant>
      </device>
      <device Dname="MKV10Z32xxx7">
        <processor Dcore="Cortex-M0+" Dfpu="NO_FPU" Dmpu="NO_MPU" Dendian="Little-endian" Dclock="75000000"/>
        <environment name="iar">
          <file category="linkerfile" name="iar/MKV10Z32xxx7_flash.icf"/>
        </environment>
        <memory name="PROGRAM_FLASH" start="0x00000000" size="0x8000" access="rx" default="1" startup="1"/>
        <memory name="SRAM" start="0x1ffff800" size="0x2000" access="rw" default="1"/>
        <algorithm name="arm/MKV_P32_1KB_SEC.FLM" start="0x00000000" size="0x00008000" RAMstart="0x20000000" RAMsize="0x00000800" default="1"/>
        <debug svd="MKV10Z7.xml"/>
        <variant Dvariant="MKV10Z32VLC7">
          <compile header="fsl_device_registers.h" define="CPU_MKV10Z32VLC7"/>
        </variant>
        <variant Dvariant="MKV10Z32VFM7">
          <compile header="fsl_device_registers.h" define="CPU_MKV10Z32VFM7"/>
        </variant>
        <variant Dvariant="MKV10Z32VLF7">
          <compile header="fsl_device_registers.h" define="CPU_MKV10Z32VLF7"/>
        </variant>
      </device>
    </family>
  </devices>
  <conditions>
    <condition id="device.MKV10Z7">
      <accept Dname="MKV10Z32xxx7" Dvariant="MKV10Z32VLC7" Dvendor="NXP:11"/>
      <accept Dname="MKV10Z32VLC7" Dvendor="NXP:11"/>
      <accept Dname="MKV10Z32xxx7" Dvariant="MKV10Z32VFM7" Dvendor="NXP:11"/>
      <accept Dname="MKV10Z32VFM7" Dvendor="NXP:11"/>
      <accept Dname="MKV10Z32xxx7" Dvariant="MKV10Z32VLF7" Dvendor="NXP:11"/>
      <accept Dname="MKV10Z32VLF7" Dvendor="NXP:11"/>
      <accept Dname="MKV10Z16xxx7" Dvariant="MKV10Z16VFM7" Dvendor="NXP:11"/>
      <accept Dname="MKV10Z16VFM7" Dvendor="NXP:11"/>
      <accept Dname="MKV10Z16xxx7" Dvariant="MKV10Z16VLC7" Dvendor="NXP:11"/>
      <accept Dname="MKV10Z16VLC7" Dvendor="NXP:11"/>
      <accept Dname="MKV10Z16xxx7" Dvariant="MKV10Z16VLF7" Dvendor="NXP:11"/>
      <accept Dname="MKV10Z16VLF7" Dvendor="NXP:11"/>
    </condition>
    <condition id="component.serial_manager_AND_utility.assert_AND_utility.debug_console">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="assert"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
    </condition>
    <condition id="utility.assert_lite_AND_utility.debug_console_lite">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="assert_lite"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console_lite"/>
    </condition>
    <condition id="_component.serial_manager_AND_utility.assert_AND_utility.debug_console__OR__utility.assert_lite_AND_utility.debug_console_lite_">
      <accept condition="component.serial_manager_AND_utility.assert_AND_utility.debug_console"/>
      <accept condition="utility.assert_lite_AND_utility.debug_console_lite"/>
    </condition>
    <condition id="device.MKV10Z7_AND___component.serial_manager_AND_utility.assert_AND_utility.debug_console__OR__utility.assert_lite_AND_utility.debug_console_lite___AND_component.uart_adapter_AND_device.MKV10Z7_startup_AND_driver.clock_AND_driver.common_AND_driver.gpio_AND_driver.port_AND_driver.smc_AND_driver.uart">
      <require condition="device.MKV10Z7"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart_adapter"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="port"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="smc"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart"/>
      <require condition="_component.serial_manager_AND_utility.assert_AND_utility.debug_console__OR__utility.assert_lite_AND_utility.debug_console_lite_"/>
    </condition>
    <condition id="device.MKV10Z7_AND_driver.dmamux_AND_driver.edma">
      <require condition="device.MKV10Z7"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
    </condition>
    <condition id="device.MKV10Z7_AND_component.gpio_adapter_AND_component.timer_manager_AND_driver.common">
      <require condition="device.MKV10Z7"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="timer_manager"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio_adapter"/>
    </condition>
    <condition id="device.MKV10Z7_AND_component.osa_AND_driver.common">
      <require condition="device.MKV10Z7"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="osa"/>
    </condition>
    <condition id="device.MKV10Z7_AND_driver.common_AND_driver.crc">
      <require condition="device.MKV10Z7"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="crc"/>
    </condition>
    <condition id="device.MKV10Z7_AND_driver.common_AND_driver.dspi">
      <require condition="device.MKV10Z7"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dspi"/>
    </condition>
    <condition id="device.MKV10Z7_AND_driver.common_AND_driver.flash">
      <require condition="device.MKV10Z7"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flash"/>
    </condition>
